#include <iostream>
using namespace std;

int main()
{
    int dayWeekNum;
    string dayWeek[7] = {"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"};
    string menu[7][4] = {
        {"Рассольник", "Котлета по Киевски", "Пюре", "Компот"},
        {"Борщ", "Пельмени", "Салат витамин", "Иван-чай"},
        {"Щавелевый суп", "Жаркое из курицы", "Кабачковые Оладьи", "Взвар из шиповника"},
        {"Гороховыый суп", "Бифстроганофф", "Маринованные грибы", "Чай облепиховый"},
        {"Солянка", "Шашлык по-Кавазски", "Зелень", "Вода минеральная"},
        {"Кислые щи", "Мясная запеканка", "морковка по-Корейски", "Морс"},
        {"Винегрет", "Мюнхские колбаски", "Тушеная капуста", "Шнапс"}
    };
    cout << " Введите день недели ( от 1 до 7): ";
    cin >> dayWeekNum;

    if (dayWeekNum < 1 || dayWeekNum > 7)
    {
        cout << " Только 7 дней в неделе !";
    } 
    else{
        dayWeekNum-=1;
        cout << "Меню сегодня(" << dayWeek[dayWeekNum] << "):\n";
        for (int i = 0; i < 7; i++)
        {
            cout << menu[dayWeekNum][i] << endl;
        }
    }







}